; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f11-p5-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)

(above f7 f8)
(above f7 f9)
(above f7 f10)

(above f8 f9)
(above f8 f10)

(above f9 f10)



(origin p0 f7)
(destin p0 f9)

(origin p1 f8)
(destin p1 f4)

(origin p2 f9)
(destin p2 f2)

(origin p3 f9)
(destin p3 f8)

(origin p4 f9)
(destin p4 f8)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
))
)

; plan
1. (up f0 f7)
   deleted: (lift-at f0)
   added: (lift-at f7)
   goals met: 0 of 5
2. (board f7 p0)
   added: (boarded p0)
   goals met: 0 of 5
3. (up f7 f9)
   deleted: (lift-at f7)
   added: (lift-at f9)
   goals met: 0 of 5
4. (depart f9 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 1 of 5
5. (board f9 p4)
   added: (boarded p4)
   goals met: 1 of 5
6. (board f9 p3)
   added: (boarded p3)
   goals met: 1 of 5
7. (board f9 p2)
   added: (boarded p2)
   goals met: 1 of 5
8. (down f9 f2)
   deleted: (lift-at f9)
   added: (lift-at f2)
   goals met: 1 of 5
9. (depart f2 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 2 of 5
10. (up f2 f8)
   deleted: (lift-at f2)
   added: (lift-at f8)
   goals met: 2 of 5
11. (board f8 p1)
   added: (boarded p1)
   goals met: 2 of 5
12. (depart f8 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 3 of 5
13. (depart f8 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 4 of 5
14. (down f8 f4)
   deleted: (lift-at f8)
   added: (lift-at f4)
   goals met: 4 of 5
15. (depart f4 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 5 of 5
